Операторы прерывания break, continue, else. Операторы прерывания цикла break Сигнальная метка используется для того, чтобы отключить, циклу работы более производительно Оператор прерывания цикла break удобен в соединении с сигнальными метками, когда после проверки проверки условия нет нам смысла выполнять цикл сигнальной метки может включаться, когда надо для одной части программы обнаружена ошибка в других частях программы. В предыдущих уроках мы говорили о цикле, который не имеет возможности замкнуться и назвал его бесконечным циклом. Самый простой способ создать бесконечный цикл в Python – это следующий код: while True: print('Python awesome!') Бесконечный цикл продолжается до тех пор, пока программа не будет прервана. Изучив оператор break, мы получили блокировку бесконечных циклов. Возможно, что бесконечные циклы лишены смысла, однако это не совсем так. Например, вы можете написать программу, которая используется и работает, постоянно принимая запросы на обслуживание. Оператор continue Другая стандартная идиома циклов пропускает редко элементы при переборе. Оператор continue позволяет перейти к следующей итерации циклов на некоторое время.

Ревью кода Ревью кода – проверка исходного кода программы с обнаружением ошибок и неточностей, которые остались незамеченными при исходной разработке. В процессе ревью кода могут быть исправлены: фактические ошибки; производительность кода; читабельность кода и ошибки форматирования кода. Целью пересмотра кода является улучшение качества кода и совершенствование навыков программиста. Как правило, ревью кода выполняется программистом с большим опытом. Производительность кода Под производительностью кода в простейшем случае можно подразумевать то, сколько времени программа тратит на решение задачи. Отступы и пробелы
